const String honey_text = '''Русское название – Медоед, лысый барсук, ратель
Латинское название – Mellivora capensis
Английское название –  Honey badger, ratel
Класс – Млекопитающие (Mammalia)
Отряд – Хищные (Carnivora)
Семейство – Куньи (Mustelidae)
Род - Медоеды (Mellivora)
Своё название зверёк получил за то, что часто разоряет пчелиные ульи, лакомясь мёдом и личинками пчёл.
В настоящее время выделяется 12 подвидов медоедов. Они отличаются, в основном, размерами, окраской спины и длиной шерсти.

Статус вида в природе

Международный статус этого вида - IUCN (LC) - существование в природе не вызывает опасений. Однако в некоторых регионах, в том числе, Южной Африке, популяция сокращается.

Вид и человек

Отношения с человеком у медоеда довольно напряжённые. Этот зверёк может иногда залезть в курятник, или начать разорять пчелиную пасеку, что, конечно, людям не нравится. Как правило, целенаправленная охота на медоедов не ведётся, однако в некоторых регионах, в частности, в Южной Африке, на них ставят капканы и раскладывают отравленную приманку. В целом, развитие сельского хозяйства и рост числа населённых пунктов ведут к вытеснению животного в менее обжитые места.
При встрече с человеком медоед стремится скрыться, но, в случае преследования, активно обороняется и может нанести тяжёлые травмы. Этот зверёк в 2002 даже внесён в книгу рекордов Гиннеса как самое бесстрашное животное.''';
const String honey_location = '''Распространение и места обитания
Медоед встречается в Африке и Азии. В Африке его ареал охватывает почти всю территорию континента, а в Азии область распространения этого зверька простирается от Аравийского полуострова до Средней Азии, охватывает полуостров Индостан до Непала.
Этот зверь живёт в разных климатических зонах, но преимущественно в лесах, степях и горных местностях до высоты 3 тысяч метров. Избегает пустыни и влажные тропические леса. Излюбленные места медоеда – глинистые и глинисто-песчаные склоны оврагов, где удобно рыть норы.''';
const String more_honey_description = '''Внешний вид и особенности морфологии

Внешность медоеда очень запоминающаяся: приземистый зверёк размером с небольшую собаку с характерной чёрно-белой окраской – на чёрном животном как будто светлая накидка, покрывающая лоб, шею, спину и часть хвоста. Больше всего медоед похож на барсука или росомаху. Длина тела 60-75 см; высота около 30 см; длина хвоста 20-30 см; масса 7-16 кг, при этом самцы немного крупнее и тяжелее самок. Телосложение коренастое, конечности и хвост относительно короткие, передние лапы снабжены длинными, прочными и острыми когтями длиной до 5 см. Голова широкая с коротким носом, глазки маленькие, ушные раковины очень короткие.
Окраска «накидки» у различных подвидов варьирует от чисто белой до тёмно-серой. В Конго, например, встречаются даже абсолютно чёрные особи. Кроме того, бывают и альбиносы. Животные разных подвидов имеют и разную длину хвоста – у кого-то он совсем короткий с заострённым кончиком, у других – подлиннее. Шерсть жёсткая и густая, её длина у разных подвидов тоже может немного варьировать.
Но у всех медоедов особенная кожа – она очень прочная и толстая, прокусить её большинству хищников просто не под силу. Кроме того, шкура будто «велика» своему владельцу: схваченный за заднюю часть тела медоед может извернуться, и тогда перед глазами хищника оказываются мощные челюсти и острые когти «добычи». Челюсти у медоеда настолько крепкие, что перед ними не может устоять даже черепаший панцирь. Видимо, эти особенности и делают зверька таким «бесстрашным», - хищники просто предпочитают с ним не связываться. В придачу к челюстям и когтям у медоеда, как и у других куньих, имеется железа, выделяющая секрет с сильным запахом. Конечно, подобно скунсу, ратель не может «стрелять» на несколько метров, но этот запах хищникам явно не нравится.
Медоед имеет отличный слух, зрение и осязание, что помогает ему быть великолепным охотником. Потенциальную жертву он может почуять даже на глубине до полуметра под землей.   

Питание и кормовое поведение

Несмотря на название, основная пища медоеда вовсе не мёд. Этот хищник в основном охотится на различных грызунов: мышей, крыс, сусликов, хомяков и других представителей этого большого отряда. Поедает он также лягушек, змей, ящериц, насекомых и паукообразных. Разоряет гнёзда птиц, гнездящихся на земле. Может нападать на детёнышей антилоп, лисиц и даже маленьких крокодилов. Не брезгует и падалью. Растительная пища  (ягоды, фрукты, некоторые коренья) поедается им лишь изредка и в небольшом количестве. Кормится, как правило, на земле, но за мёдом залезает на деревья.
Особые «отношения» у медоеда со змеями. Бесстрашный зверёк охотится даже на очень ядовитых змей, при этом укусы этих пресмыкающихся не являются для хищника смертельными. Описано, что после укуса кобры медоед либо бьётся в конвульсиях в течение полутора-двух часов, либо яд его парализует, но, спустя пару часов животное поднимается на ноги и уже не проявляет никаких признаков недомогания. Возможно, благодаря толстой шкуре и слою подкожного жира яд попадает в организм лишь в очень ограниченном количестве. Однако необычная реакция медоеда на змеиные яды до конца ещё не изучена.
Что касается особого лакомства для медоеда – мёда, нельзя не отметить особые отношения между этим зверьком и небольшой птичкой из отряда дятлов – медоуказчиком. Эта птичка, помимо насекомых и их личинок, ест воск из пчелиных сот. Найдя улей, медоуказчик не может самостоятельно забраться в него и покормиться, он летит искать себе помощника. Помощником может оказаться человек (местное население в Африке активно пользуется услугами птички, которая, издавая особые звуки, «приводит» к улью), а может и медоед. Зверёк отлично понимает птичку, которая, перелетая с ветки на ветку и издавая характерные звуки, приводит его к любимому лакомству. Медоеду остаётся только разворошить улей, невзирая на разъярённых пчёл, неспособных прокусить толстую кожу хищника, а затем полакомиться мёдом и закусить личинками. Медоуказчику достаются пчелиные соты и немного личинок, не съеденных зверьком.

Образ жизни и социальное поведение

Медоед – одиночка, у каждой особи есть своя территория, довольно обширная, часто площадью в несколько квадратных километров. Границы её помечаются секретом анальных желёз с сильным неприятным запахом. На участке животного имеются несколько нор, каждая из которых достигает в длину 2-3 метра. В норе есть уютная комната, выстланная мягкой травой, и в ней зверёк отдыхает от жары. Нору медоед роет сам, либо занимает логово трубкозуба или бородавочника. Перемещаясь по участку и совершая длительные переходы, медоед каждый раз останавливается для отдыха в другой норе, и очень редко ночует в ней два дня подряд.
Активен зверь преимущественно в сумерках или ночью, однако, если погода прохладная или дождливая, его можно увидеть и днём.
Встреча нескольких медоедов говорит о том, что это выводок, который распадается, когда детёнышам исполнится 1-2 года. Вообще, поведение рателей в природе практически не изучено.
Медоеды считаются бесстрашными и даже агрессивными животными, у них почти нет естественных врагов. Сами же они, если чувствуют угрозу, могут нападать на животных, значительно крупнее себя, даже львов.

Вокализация

Голос медоеда звучит как хриплый звук «хря-я-я-я». При спаривании самцы издают громкие хрюкающие звуки, недовольные детёныши жалобно хнычат. Сталкиваясь с собаками, медоеды кричат как медвежата: нечто среднее между рёвом и визгом.

Размножение и родительское поведение

О размножении медоедов известно немного. В брачный период они встречаются парами, затем пара распадается, и самка одна выкармливает детёнышей.
Для медоедов, как других видов куньих, характерен латентный период беременности: по одним данным с момента спаривания до рождения малышей проходит 4 месяца, по другим – 6. В помёте 1-4 детёныша, в среднем - 2. Детёныши рождаются слепыми и лишёнными шерсти. Первые несколько недель они проводят в норе, точнее, в норах, поскольку заботливая мать каждые несколько дней перетаскивает своё потомство в другое логово. Когда малыши подрастают, они переходят от норы к норе самостоятельно, следуя «гуськом» за матерью. В трёхмесячном возрасте детёныши начинают отходить от норы и делать первые попытки охотиться.
С матерью молодые животные остаются до года, или немного дольше. Половозрелыми становятся в возрасте 1,5 лет.

Продолжительность жизни

В неволе медоеды доживают до 26 лет, в природе продолжительность их жизни неизвестна.

Жизнь в зоопарке

Пара медоедов (двухлетние самец и самка) впервые появилась у нас в мае 2021 года. Лето животные провели в Центре воспроизводства редких видов животных, а в сентябре их перевезли в зоопарк. Увидеть медоедов можно в африканском павильоне на Новой территории, где специально для них оборудованы два внутренних вольера и просторный уличный.
Животные прибыли из Чехии, дорогу и адаптацию к новому месту жительства перенесли хорошо, здоровы и активны. В вольерах у них есть полые брёвна, в которые можно залезать, вертикально подвешенные брёвна, специальные домики. Мы стараемся, чтобы животные могли побольше двигаться и проявлять свои естественные формы поведения.
В рационе у медоедов разнообразное мясо: говядина, курица, конина, баранина. В небольших количествах дают овощи и фрукты. Еду также дают не «на блюдечке», а раскладывают в разных местах, чтобы животные её поискали, и им не было «скучно».
Надеемся, что эти очень интересные животные будут жить в нашем зоопарке долго и дарить нам маленьких медоедиков.''';