const String Home = "Главная";
const String Zoo_Map = "Карта";
const String Animals = "Наши животные";
const String Other = "Ещё";
const String tickets_link = "https://tickets.mos.ru/widget/visit?agentId=museum28&eventId=1473";
const String zoo_location_link = "https://yandex.ru/maps/org/moskovskiy_zoopark/1110600521/?ll=37.576789%2C55.762642&z=17";

const int AppMainColor = 0xFF0D4D56;
const int AppSecondColor = 0xFF25545C;
const int AppUnselectedTextColor = 0xFFC1C1C1;
const int AppTextColor = 0xFFFFFFFF;

final String number = "+74992555375";

// onTap: () => {Navigator.push(context, MaterialPageRoute(builder: (context) => Rules()))},

const String Rules_text = '''
·   Иногда вам кажется, что животные попрошайничают. На самом деле — это их способ развлечения и установления контакта с вами. Пожалуйста, не кормите животных. От этого они болеют. Мы заботимся о разнообразном питании наших зверей. В их стандартных рацион входят и их любимые лакомства.

·   Не перелезайте через барьеры и не заходите за ограждения, не заходите в вольеры и служебные помещения. Это опасно! Помните, что в зоопарке живут дикие животные!

·   Не залезайте на скульптурные формы на территории Московского зоопарка.

·   Не заходите в зоны строительства — там, действительно, нет ничего интересного. Это опасно!

·   Сидеть и стоять на барьере очень неудобно. Но главное — опасно. Поэтому, пожалуйста, не сажайте ваших детей на барьеры и ограды. Не прислоняйтесь к решеткам и стеклам.

·   Обращаем ваше внимание, что согласно правилам зоопарка НЕЛЬЗЯ приносить с собой любой подвижный (передвижной) транспорт, а также малые летающие аппараты для использования в личных целях.

·   В   Московский зоопарк запрещено приносить : колёсные гаджеты (гироскутеры, сигвеи, моноколеса), а также самокаты, скейтборды, роликовые коньки и  велосипеды.
Исключения составляют детские коляски, а также для людей с ограниченными возможностями: инвалидные коляски (кресла), ходунки.
Это вынужденная мера в целях вашей безопасности, т.к. зоопарк не располагает выделенными дорожками для катания, как это есть в других парках, в летний период времени, особенно в выходные и праздничные дни.
Из-за большого количества посетителей по территории зоопарка просто невозможно развернуться, и катание может привести к неоправданным травмам и вреду вашему здоровью в результате нежелательных наездов и столкновений.

·   У нас запрещены мультикоптеры и квадрокоптеры (они же дроны), малые летательные аппараты, управляемые дистанционно, они пугают обитателей зоопарка.

·   Пожалуйста, фотографируйте животных без вспышки. Фотовспышка в глаза неприятна не только вам, но и животным.

·   У животных не принято здороваться за руку: не протягивайте через решетки и сетки руки, ноги, зонты, сумки и прочие предметы. Уважайте личное пространство животного и берегите свою жизнь и здоровье.

·   Для общей безопасности запрещается посещать Московский зоопарк с домашними животными, крупногабаритными сумками, рюкзаками и чемоданами. В целях обеспечения необходимых мер безопасности и антитеррористической защищённости при входе на территорию Московского зоопарка Посетитель предъявляет сотруднику службы безопасности Московского зоопарка к визуальному осмотру свою(свои) крупно габаритную(ые) сумку(и) и ручную кладь.

·   Просим вас не курить у нас в гостях.

·   Не бросайте мусор в вольеры и в бассейны! На территории зоопарка расставлено достаточное количество урн.

·   Не дразните животных: не стучите по стеклам вольеров. Вы пугаете животных. Просим уважать животных и их право на отдых.

·   На территории зоопарка много кустарников, деревьев и газонов. Они посажены специально для вас. Просим вас не ломать ветки, не рвать цветы и не ходить по газонам.

·   В зоопарке нельзя наносить надписи и расклеивать объявления; использовать территорию зоопарка для получения дохода.

За нарушение правил посещения Московского зоопарка Посетитель может быть не допущен на его территорию либо удален с территории зоопарка!''';

const String Rules_warning_title = '''ВАЖНАЯ ИНФОРМАЦИЯ
(для посетителей льготной категории)''';

const String Rules_warning = '''Обращаем внимание, что для подтверждения права на льготное (бесплатное) посещение зоопарка наряду с документом, подтверждающим льготу, необходимо предъявить документ с фотографией, удостоверяющий личность, (паспорт), а также, во избежание возникновения спорных ситуаций, учащимся старших классов средней школы необходимо иметь при себе паспорт для подтверждения возраста и права на льготное (бесплатное) посещение зоопарка.
Приносим извинения за доставленные неудобства!
Надеемся на ваше понимание!''';

final String bibl = """Для лиц, профессионально занимающихся научной деятельностью и не имеющих права на бесплатный вход на территорию ГАУ «Московский зоопарк», предусмотрен особый Регламент прохода в помещение библиотеки для работы с книжным фондом научной библиотеки.

Информационная справка о фонде научной библиотеки Московского зоопарка

Фонд научной библиотеки формировался начиная с конца XIX века с учетом научных потребностей специалистов Московского зоопарка. В книжном фонде собраны зарубежные и русские издания по зоологии начала XX века, учебники, научные труды в области зоологии и зоопарковского дела, определители, издания Московского зоопарка, а также путеводители и брошюры, выпущенные зарубежными зоопарками, справочные издания, современные энциклопедии. Это более 16 200 изданий. Наша коллекция пополняется, книжные новинки представлены на выставке новых поступлений.

Особое место занимает книжная коллекция доктора биологических наук, профессора, академика Академии естественных наук России Владимира Евгеньевича Флинта. Литература по орнитологии на русском языке, представленная в этой коллекции, собрана с практически исчерпывающей полнотой и охватывает период с конца XIX века до наших дней. Интерес представляют и издания с владельческими и дарственными надписями, автографами.""";
